# vim: set ft=ruby :

def is_m1?
  !RUBY_PLATFORM.index("arm64e").nil?
end

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
# tap 'nektos/tap' # ! x86_64?

# Audio & Broadcasting
brew 'ffmpeg'
cask 'audio-hijack'
cask 'loopback'
cask 'obs'
cask 'vlc'

# Cloud storages
cask 'adobe-creative-cloud'
cask 'dropbox'
cask 'omnipresence'

# Development
brew 'gcc'
brew 'jq'
brew 'pict'
cask 'adoptopenjdk'

# Development: IDE
brew 'vim'
cask 'atom'
cask 'sublime-text'
cask 'visual-studio-code', greedy: true

# Development: for Mobile apps
cask 'android-studio'
cask 'unity-hub'

# Development: for Web apps
brew 'mkcert'
brew 'nss'
cask 'ngrok'

# Documentations
brew 'graphviz'
brew 'mdp'
# brew 'pandoc' # ! x86_64?

# Devices
cask 'canon-mf-printer'
cask 'drobo-dashboard'
cask 'logitech-firmwareupdatetool'
cask 'logitech-g-hub'
cask 'logitech-gaming-software'
# cask 'haptickey' # ! Problem on M1 environment

# Files
brew 'broot'
brew 'p7zip'
brew 'rename'
brew 'rsync'
brew 'subversion'

# Fonts
cask 'font-hackgen-nerd'
cask 'font-lato'

# Games
cask 'minecraft'
cask 'steam'
cask 'stepmania'

# GitHub
brew 'git'
brew 'gist'
brew 'git-lfs'
brew 'hub'
# cask 'act' # ! x86_64?

# Messaging
brew 'mmctl'
cask 'discord-ptb'
cask 'mattermost'
cask 'keybase'
cask 'skype'
cask 'zoom'

# Miscs
brew 'proctools'
brew 'mackup'
brew 'mas'
brew 'nyancat'

# Remote tools
brew 'curl'
brew 'inetutils' # includes the telnet
brew 'wget'
# cask 'osxfuse'
cask 'vnc-viewer'

# Shell
cask 'dotnet'
cask 'powershell'
brew 'terminal-notifier'
brew 'thefuck'
brew 'zsh-completions'

# Signature
brew 'unbound', restart_service: true
brew 'gnupg'
brew 'pinentry-mac'

# Tasks & Memos
cask 'boost-note'
cask 'grammarly'
cask 'notion'

# Virtualizations
# cask 'docker' # ! Use the technical preview
# cask 'parallels' # ! Use the technical preview
cask 'vagrant'
# cask 'virtualbox' # ! x86_64?
# cask 'virtualbox-extension-pack' # ! x86_64?

# Web browsers
brew 'links'
cask 'firefox'
cask 'google-chrome', greedy: true

# mas
# mas 'Cinebench', id: 1438772273
# mas 'Developer', id: 640199958
# mas 'Disk Speed Test', id: 1480068668
# mas 'GarageBand', id: 682658836
# mas "GFXBench Metal", id: 1044629456
# mas 'Grammarly for Safari', id: 1462114288
# mas 'Human Resource Machine', id: 1005728312
# mas 'iMovie', id: 408981434
# mas 'Keynote', id: 409183694
# mas 'Kindle', id: 405399194
# mas 'LINE', id: 539883307
# mas 'Messenger', id: 1480068668
# mas 'Microsoft Excel', id: 462058435
# mas 'Microsoft OneNote', id: 784801555
# mas 'Microsoft PowerPoint', id: 462062816
# mas 'Microsoft Remote Desktop', id: 1295203466
# mas "Microsoft To Do", id: 1274495053
# mas 'Microsoft Word', id: 462054704
# mas 'Numbers', id: 409203825
# mas 'OmniFocus', id: 1474135619
# mas 'OneDrive', id: 823766827
# mas 'Pages', id: 409201541
# mas 'Remote Desktop', id: 409907375
# mas 'Slack', id: 803453959
# mas "Twitter", id: 1482454543
# mas 'Xcode', id: 497799835
